STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251cxx_ca35.h
/***************  Bit definition for ETH_MTLESTSCHER register  ****************/
#define ETH_MTLESTSCHER_SEQN_Pos            (0U)
#define ETH_MTLESTSCHER_SEQN_Msk            (0xFUL << ETH_MTLESTSCHER_SEQN_Pos)                   /*!< 0x0000000F */
#define ETH_MTLESTSCHER_SEQN                ETH_MTLESTSCHER_SEQN_Msk                            /*!< Schedule Error Queue Number */

/****************  Bit definition for ETH_MTLESTFSER register  ****************/
#define ETH_MTLESTFSER_FEQN_Pos             (0U)
#define ETH_MTLESTFSER_FEQN_Msk             (0xFUL << ETH_MTLESTFSER_FEQN_Pos)                    /*!< 0x0000000F */
#define ETH_MTLESTFSER_FEQN                 ETH_MTLESTFSER_FEQN_Msk                             /*!< Frame Size Error Queue Number */

/****************  Bit definition for ETH_MTLESTFSCR register  ****************/
#define ETH_MTLESTFSCR_HBFS_Pos             (0U)
#define ETH_MTLESTFSCR_HBFS_Msk             (0x7FFFUL << ETH_MTLESTFSCR_HBFS_Pos)                 /*!< 0x00007FFF */
#define ETH_MTLESTFSCR_HBFS                 ETH_MTLESTFSCR_HBFS_Msk                             /*!< Frame Size of HLBF */
#define ETH_MTLESTFSCR_HBFQ_Pos             (16U)
#define ETH_MTLESTFSCR_HBFQ_Msk             (0x3UL << ETH_MTLESTFSCR_HBFQ_Pos)                    /*!< 0x00030000 */
#define ETH_MTLESTFSCR_HBFQ                 ETH_MTLESTFSCR_HBFQ_Msk                             /*!< Queue Number of HLBF */

/****************  Bit definition for ETH_MTLESTIER register  *****************/
#define ETH_MTLESTIER_IECC_Pos              (0U)
#define ETH_MTLESTIER_IECC_Msk              (0x1UL << ETH_MTLESTIER_IECC_Pos)                     /*!< 0x00000001 */
#define ETH_MTLESTIER_IECC                  ETH_MTLESTIER_IECC_Msk                              /*!< Interrupt Enable for Switch List */
#define ETH_MTLESTIER_IEBE_Pos              (1U)
#define ETH_MTLESTIER_IEBE_Msk              (0x1UL << ETH_MTLESTIER_IEBE_Pos)                     /*!< 0x00000002 */
#define ETH_MTLESTIER_IEBE                  ETH_MTLESTIER_IEBE_Msk                              /*!< Interrupt Enable for BTR Error */
#define ETH_MTLESTIER_IEHF_Pos              (2U)
#define ETH_MTLESTIER_IEHF_Msk              (0x1UL << ETH_MTLESTIER_IEHF_Pos)                     /*!< 0x00000004 */
#define ETH_MTLESTIER_IEHF                  ETH_MTLESTIER_IEHF_Msk                              /*!< Interrupt Enable for HLBF */
#define ETH_MTLESTIER_IEHS_Pos              (3U)
#define ETH_MTLESTIER_IEHS_Msk              (0x1UL << ETH_MTLESTIER_IEHS_Pos)                     /*!< 0x00000008 */
#define ETH_MTLESTIER_IEHS                  ETH_MTLESTIER_IEHS_Msk                              /*!< Interrupt Enable for HLBS */
#define ETH_MTLESTIER_CGCE_Pos              (4U)
#define ETH_MTLESTIER_CGCE_Msk              (0x1UL << ETH_MTLESTIER_CGCE_Pos)                     /*!< 0x00000010 */
#define ETH_MTLESTIER_CGCE                  ETH_MTLESTIER_CGCE_Msk                              /*!< Interrupt Enable for CGCE */

/***************  Bit definition for ETH_MTLESTGCLCR register  ****************/
#define ETH_MTLESTGCLCR_SRWO_Pos            (0U)
#define ETH_MTLESTGCLCR_SRWO_Msk            (0x1UL << ETH_MTLESTGCLCR_SRWO_Pos)                   /*!< 0x00000001 */
#define ETH_MTLESTGCLCR_SRWO                ETH_MTLESTGCLCR_SRWO_Msk                            /*!< Start Read/Write Operation */
#define ETH_MTLESTGCLCR_R1W0_Pos            (1U)
#define ETH_MTLESTGCLCR_R1W0_Msk            (0x1UL << ETH_MTLESTGCLCR_R1W0_Pos)                   /*!< 0x00000002 */
#define ETH_MTLESTGCLCR_R1W0                ETH_MTLESTGCLCR_R1W0_Msk                            /*!< Read 1, Write 0 */
#define ETH_MTLESTGCLCR_GCRR_Pos            (2U)
#define ETH_MTLESTGCLCR_GCRR_Msk            (0x1UL << ETH_MTLESTGCLCR_GCRR_Pos)                   /*!< 0x00000004 */
#define ETH_MTLESTGCLCR_GCRR                ETH_MTLESTGCLCR_GCRR_Msk                            /*!< Gate Control Related registers */
#define ETH_MTLESTGCLCR_DBGM_Pos            (4U)
#define ETH_MTLESTGCLCR_DBGM_Msk            (0x1UL << ETH_MTLESTGCLCR_DBGM_Pos)                   /*!< 0x00000010 */
#define ETH_MTLESTGCLCR_DBGM                ETH_MTLESTGCLCR_DBGM_Msk                            /*!< Debug Mode */
#define ETH_MTLESTGCLCR_DBGB_Pos            (5U)
#define ETH_MTLESTGCLCR_DBGB_Msk            (0x1UL << ETH_MTLESTGCLCR_DBGB_Pos)                   /*!< 0x00000020 */
#define ETH_MTLESTGCLCR_DBGB                ETH_MTLESTGCLCR_DBGB_Msk                            /*!< Debug Mode Bank Select */
#define ETH_MTLESTGCLCR_ADDR_Pos            (8U)
#define ETH_MTLESTGCLCR_ADDR_Msk            (0x3FUL << ETH_MTLESTGCLCR_ADDR_Pos)                  /*!< 0x00003F00 */
#define ETH_MTLESTGCLCR_ADDR                ETH_MTLESTGCLCR_ADDR_Msk                            /*!< Gate Control List Address: */

/***************  Bit definition for ETH_MTLESTGCLDR register  ****************/
#define ETH_MTLESTGCLDR_GCD_Pos             (0U)
#define ETH_MTLESTGCLDR_GCD_Msk             (0xFFFFFFFFUL << ETH_MTLESTGCLDR_GCD_Pos)            /*!< 0xFFFFFFFF */
#define ETH_MTLESTGCLDR_GCD                 ETH_MTLESTGCLDR_GCD_Msk                             /*!< Gate Control Data */

/****************  Bit definition for ETH_MTLFPECSR register  *****************/
#define ETH_MTLFPECSR_AFSZ_Pos              (0U)
#define ETH_MTLFPECSR_AFSZ_Msk              (0x3UL << ETH_MTLFPECSR_AFSZ_Pos)                     /*!< 0x00000003 */
#define ETH_MTLFPECSR_AFSZ                  ETH_MTLFPECSR_AFSZ_Msk                              /*!< Additional Fragment Size */
#define ETH_MTLFPECSR_LBHT_Pos              (7U)
#define ETH_MTLFPECSR_LBHT_Msk              (0x1UL << ETH_MTLFPECSR_LBHT_Pos)                     /*!< 0x00000080 */
#define ETH_MTLFPECSR_LBHT                  ETH_MTLFPECSR_LBHT_Msk                              /*!< Level-based Hold Transition */
#define ETH_MTLFPECSR_PEC_Pos               (8U)
#define ETH_MTLFPECSR_PEC_Msk               (0xFUL << ETH_MTLFPECSR_PEC_Pos)                      /*!< 0x00000F00 */
#define ETH_MTLFPECSR_PEC                   ETH_MTLFPECSR_PEC_Msk                               /*!< Preemption Classification */
#define ETH_MTLFPECSR_HRS_Pos               (28U)
#define ETH_MTLFPECSR_HRS_Msk               (0x1UL << ETH_MTLFPECSR_HRS_Pos)                      /*!< 0x10000000 */
#define ETH_MTLFPECSR_HRS                   ETH_MTLFPECSR_HRS_Msk                               /*!< Hold/Release Status */

/*****************  Bit definition for ETH_MTLFPEAR register  *****************/
#define ETH_MTLFPEAR_HADV_Pos               (0U)
#define ETH_MTLFPEAR_HADV_Msk               (0xFFFFUL << ETH_MTLFPEAR_HADV_Pos)                   /*!< 0x0000FFFF */
#define ETH_MTLFPEAR_HADV                   ETH_MTLFPEAR_HADV_Msk                               /*!< Hold Advance */
#define ETH_MTLFPEAR_RADV_Pos               (16U)
#define ETH_MTLFPEAR_RADV_Msk               (0xFFFFUL << ETH_MTLFPEAR_RADV_Pos)                   /*!< 0xFFFF0000 */
#define ETH_MTLFPEAR_RADV                   ETH_MTLFPEAR_RADV_Msk                               /*!< Release Advance */

/************  Bit definition for ETH_MTLTXQ0OMR register  *************/
#define ETH_MTLTXQ0OMR_FTQ_Pos              (0U)
#define ETH_MTLTXQ0OMR_FTQ_Msk              (0x1UL << ETH_MTLTXQ0OMR_FTQ_Pos)                    /*!< 0x00000001 */
#define ETH_MTLTXQ0OMR_FTQ                  ETH_MTLTXQ0OMR_FTQ_Msk                              /*!< Flush Transmit Queue */
#define ETH_MTLTXQ0OMR_TSF_Pos              (1U)
#define ETH_MTLTXQ0OMR_TSF_Msk              (0x1UL << ETH_MTLTXQ0OMR_TSF_Pos)                    /*!< 0x00000002 */
#define ETH_MTLTXQ0OMR_TSF                  ETH_MTLTXQ0OMR_TSF_Msk                              /*!< Transmit Store and Forward */
#define ETH_MTLTXQ0OMR_TXQEN_Pos            (2U)
#define ETH_MTLTXQ0OMR_TXQEN_Msk            (0x3UL << ETH_MTLTXQ0OMR_TXQEN_Pos)                  /*!< 0x0000000C */
#define ETH_MTLTXQ0OMR_TXQEN                ETH_MTLTXQ0OMR_TXQEN_Msk                            /*!< Transmit Queue Enable */
#define ETH_MTLTXQ0OMR_TXQEN_0              (0x1UL << ETH_MTLTXQ0OMR_TXQEN_Pos)                  /*!< 0x00000004 */
#define ETH_MTLTXQ0OMR_TXQEN_1              (0x2UL << ETH_MTLTXQ0OMR_TXQEN_Pos)                  /*!< 0x00000008 */
#define ETH_MTLTXQ0OMR_TTC_Pos              (4U)
#define ETH_MTLTXQ0OMR_TTC_Msk              (0x7UL << ETH_MTLTXQ0OMR_TTC_Pos)                    /*!< 0x00000070 */
#define ETH_MTLTXQ0OMR_TTC                  ETH_MTLTXQ0OMR_TTC_Msk                              /*!< Transmit Threshold Control */
#define ETH_MTLTXQ0OMR_TTC_32BITS           (0x0UL << ETH_MTLTXQ0OMR_TTC_Pos)                    /*!< 0x00000000 */
#define ETH_MTLTXQ0OMR_TTC_64BITS           (0x1UL << ETH_MTLTXQ0OMR_TTC_Pos)                    /*!< 0x00000010 */
#define ETH_MTLTXQ0OMR_TTC_96BITS           (0x2UL << ETH_MTLTXQ0OMR_TTC_Pos)                    /*!< 0x00000020 */
#define ETH_MTLTXQ0OMR_TTC_128BITS          (0x3UL << ETH_MTLTXQ0OMR_TTC_Pos)                    /*!< 0x00000030 */
#define ETH_MTLTXQ0OMR_TTC_192BITS          (0x4UL << ETH_MTLTXQ0OMR_TTC_Pos)                    /*!< 0x00000040 */
#define ETH_MTLTXQ0OMR_TTC_256BITS          (0x5UL << ETH_MTLTXQ0OMR_TTC_Pos)                    /*!< 0x00000050 */
#define ETH_MTLTXQ0OMR_TTC_384BITS          (0x6UL << ETH_MTLTXQ0OMR_TTC_Pos)                    /*!< 0x00000060 */
#define ETH_MTLTXQ0OMR_TTC_512BITS          (0x7UL << ETH_MTLTXQ0OMR_TTC_Pos)                    /*!< 0x00000070 */
#define ETH_MTLTXQ0OMR_TQS_Pos              (16U)
#define ETH_MTLTXQ0OMR_TQS_Msk              (0x1FFUL << ETH_MTLTXQ0OMR_TQS_Pos)                  /*!< 0x01FF0000 */
#define ETH_MTLTXQ0OMR_TQS                  ETH_MTLTXQ0OMR_TQS_Msk                              /*!< Transmit Queue Size */
#define ETH_MTLTXQ0OMR_TQS_0                (0x1UL << ETH_MTLTXQ0OMR_TQS_Pos)                    /*!< 0x00010000 */
#define ETH_MTLTXQ0OMR_TQS_1                (0x2UL << ETH_MTLTXQ0OMR_TQS_Pos)                    /*!< 0x00020000 */
#define ETH_MTLTXQ0OMR_TQS_2                (0x4UL << ETH_MTLTXQ0OMR_TQS_Pos)                    /*!< 0x00040000 */
#define ETH_MTLTXQ0OMR_TQS_3                (0x8UL << ETH_MTLTXQ0OMR_TQS_Pos)                    /*!< 0x00080000 */
#define ETH_MTLTXQ0OMR_TQS_4                (0x10UL << ETH_MTLTXQ0OMR_TQS_Pos)                   /*!< 0x00100000 */
#define ETH_MTLTXQ0OMR_TQS_5                (0x20UL << ETH_MTLTXQ0OMR_TQS_Pos)                   /*!< 0x00200000 */
#define ETH_MTLTXQ0OMR_TQS_6                (0x40UL << ETH_MTLTXQ0OMR_TQS_Pos)                   /*!< 0x00400000 */
#define ETH_MTLTXQ0OMR_TQS_7                (0x80UL << ETH_MTLTXQ0OMR_TQS_Pos)                   /*!< 0x00800000 */
#define ETH_MTLTXQ0OMR_TQS_8                (0x100UL << ETH_MTLTXQ0OMR_TQS_Pos)                  /*!< 0x01000000 */

/*************  Bit definition for ETH_MTLTXQ0UR register  *************/
#define ETH_MTLTXQ0UR_UFFRMCNT_Pos          (0U)
#define ETH_MTLTXQ0UR_UFFRMCNT_Msk          (0x7FFUL << ETH_MTLTXQ0UR_UFFRMCNT_Pos)              /*!< 0x000007FF */
#define ETH_MTLTXQ0UR_UFFRMCNT              ETH_MTLTXQ0UR_UFFRMCNT_Msk                          /*!< Underflow Packet Counter */
#define ETH_MTLTXQ0UR_UFFRMCNT_0            (0x1UL << ETH_MTLTXQ0UR_UFFRMCNT_Pos)                /*!< 0x00000001 */
#define ETH_MTLTXQ0UR_UFFRMCNT_1            (0x2UL << ETH_MTLTXQ0UR_UFFRMCNT_Pos)                /*!< 0x00000002 */
#define ETH_MTLTXQ0UR_UFFRMCNT_2            (0x4UL << ETH_MTLTXQ0UR_UFFRMCNT_Pos)                /*!< 0x00000004 */
#define ETH_MTLTXQ0UR_UFFRMCNT_3            (0x8UL << ETH_MTLTXQ0UR_UFFRMCNT_Pos)                /*!< 0x00000008 */
#define ETH_MTLTXQ0UR_UFFRMCNT_4            (0x10UL << ETH_MTLTXQ0UR_UFFRMCNT_Pos)               /*!< 0x00000010 */
#define ETH_MTLTXQ0UR_UFFRMCNT_5            (0x20UL << ETH_MTLTXQ0UR_UFFRMCNT_Pos)               /*!< 0x00000020 */
#define ETH_MTLTXQ0UR_UFFRMCNT_6            (0x40UL << ETH_MTLTXQ0UR_UFFRMCNT_Pos)               /*!< 0x00000040 */
#define ETH_MTLTXQ0UR_UFFRMCNT_7            (0x80UL << ETH_MTLTXQ0UR_UFFRMCNT_Pos)               /*!< 0x00000080 */
#define ETH_MTLTXQ0UR_UFFRMCNT_8            (0x100UL << ETH_MTLTXQ0UR_UFFRMCNT_Pos)              /*!< 0x00000100 */
#define ETH_MTLTXQ0UR_UFFRMCNT_9            (0x200UL << ETH_MTLTXQ0UR_UFFRMCNT_Pos)              /*!< 0x00000200 */
#define ETH_MTLTXQ0UR_UFFRMCNT_10           (0x400UL << ETH_MTLTXQ0UR_UFFRMCNT_Pos)              /*!< 0x00000400 */
#define ETH_MTLTXQ0UR_UFCNTOVF_Pos          (11U)
#define ETH_MTLTXQ0UR_UFCNTOVF_Msk          (0x1UL << ETH_MTLTXQ0UR_UFCNTOVF_Pos)                /*!< 0x00000800 */
#define ETH_MTLTXQ0UR_UFCNTOVF              ETH_MTLTXQ0UR_UFCNTOVF_Msk                          /*!< Overflow Bit for Underflow Packet Counter */

/*************  Bit definition for ETH_MTLTXQ0DR register  *************/
#define ETH_MTLTXQ0DR_TXQPAUSED_Pos         (0U)
#define ETH_MTLTXQ0DR_TXQPAUSED_Msk         (0x1UL << ETH_MTLTXQ0DR_TXQPAUSED_Pos)               /*!< 0x00000001 */
#define ETH_MTLTXQ0DR_TXQPAUSED             ETH_MTLTXQ0DR_TXQPAUSED_Msk                         /*!< Transmit Queue in Pause */
#define ETH_MTLTXQ0DR_TRCSTS_Pos            (1U)
#define ETH_MTLTXQ0DR_TRCSTS_Msk            (0x3UL << ETH_MTLTXQ0DR_TRCSTS_Pos)                  /*!< 0x00000006 */
#define ETH_MTLTXQ0DR_TRCSTS                ETH_MTLTXQ0DR_TRCSTS_Msk                            /*!< MTL Tx Queue Read Controller Status */
#define ETH_MTLTXQ0DR_TRCSTS_0              (0x1UL << ETH_MTLTXQ0DR_TRCSTS_Pos)                  /*!< 0x00000002 */
#define ETH_MTLTXQ0DR_TRCSTS_1              (0x2UL << ETH_MTLTXQ0DR_TRCSTS_Pos)                  /*!< 0x00000004 */
#define ETH_MTLTXQ0DR_TWCSTS_Pos            (3U)
#define ETH_MTLTXQ0DR_TWCSTS_Msk            (0x1UL << ETH_MTLTXQ0DR_TWCSTS_Pos)                  /*!< 0x00000008 */
#define ETH_MTLTXQ0DR_TWCSTS                ETH_MTLTXQ0DR_TWCSTS_Msk                            /*!< MTL Tx Queue Write Controller Status */
#define ETH_MTLTXQ0DR_TXQSTS_Pos            (4U)
#define ETH_MTLTXQ0DR_TXQSTS_Msk            (0x1UL << ETH_MTLTXQ0DR_TXQSTS_Pos)                  /*!< 0x00000010 */
#define ETH_MTLTXQ0DR_TXQSTS                ETH_MTLTXQ0DR_TXQSTS_Msk                            /*!< MTL Tx Queue Not Empty Status */
#define ETH_MTLTXQ0DR_TXSTSFSTS_Pos         (5U)
#define ETH_MTLTXQ0DR_TXSTSFSTS_Msk         (0x1UL << ETH_MTLTXQ0DR_TXSTSFSTS_Pos)               /*!< 0x00000020 */
#define ETH_MTLTXQ0DR_TXSTSFSTS             ETH_MTLTXQ0DR_TXSTSFSTS_Msk                         /*!< MTL Tx Status FIFO Full Status */
#define ETH_MTLTXQ0DR_PTXQ_Pos              (16U)
#define ETH_MTLTXQ0DR_PTXQ_Msk              (0x7UL << ETH_MTLTXQ0DR_PTXQ_Pos)                    /*!< 0x00070000 */
#define ETH_MTLTXQ0DR_PTXQ                  ETH_MTLTXQ0DR_PTXQ_Msk                              /*!< Number of Packets in the Transmit Queue */
#define ETH_MTLTXQ0DR_PTXQ_0                (0x1UL << ETH_MTLTXQ0DR_PTXQ_Pos)                    /*!< 0x00010000 */
#define ETH_MTLTXQ0DR_PTXQ_1                (0x2UL << ETH_MTLTXQ0DR_PTXQ_Pos)                    /*!< 0x00020000 */
#define ETH_MTLTXQ0DR_PTXQ_2                (0x4UL << ETH_MTLTXQ0DR_PTXQ_Pos)                    /*!< 0x00040000 */
#define ETH_MTLTXQ0DR_STXSTSF_Pos           (20U)
#define ETH_MTLTXQ0DR_STXSTSF_Msk           (0x7UL << ETH_MTLTXQ0DR_STXSTSF_Pos)                 /*!< 0x00700000 */
#define ETH_MTLTXQ0DR_STXSTSF               ETH_MTLTXQ0DR_STXSTSF_Msk                           /*!< Number of Status Words in Tx Status FIFO of Queue */
#define ETH_MTLTXQ0DR_STXSTSF_0             (0x1UL << ETH_MTLTXQ0DR_STXSTSF_Pos)                 /*!< 0x00100000 */
#define ETH_MTLTXQ0DR_STXSTSF_1             (0x2UL << ETH_MTLTXQ0DR_STXSTSF_Pos)                 /*!< 0x00200000 */
#define ETH_MTLTXQ0DR_STXSTSF_2             (0x4UL << ETH_MTLTXQ0DR_STXSTSF_Pos)                 /*!< 0x00400000 */

/************  Bit definition for ETH_MTLTXQ0ESR register  *************/
#define ETH_MTLTXQ0ESR_ABS_Pos              (0U)
#define ETH_MTLTXQ0ESR_ABS_Msk              (0xFFFFFFUL << ETH_MTLTXQ0ESR_ABS_Pos)               /*!< 0x00FFFFFF */
#define ETH_MTLTXQ0ESR_ABS                  ETH_MTLTXQ0ESR_ABS_Msk                              /*!< Average Bits per Slot */
#define ETH_MTLTXQ0ESR_ABS_0                (0x1UL << ETH_MTLTXQ0ESR_ABS_Pos)                    /*!< 0x00000001 */
#define ETH_MTLTXQ0ESR_ABS_1                (0x2UL << ETH_MTLTXQ0ESR_ABS_Pos)                    /*!< 0x00000002 */
#define ETH_MTLTXQ0ESR_ABS_2                (0x4UL << ETH_MTLTXQ0ESR_ABS_Pos)                    /*!< 0x00000004 */
#define ETH_MTLTXQ0ESR_ABS_3                (0x8UL << ETH_MTLTXQ0ESR_ABS_Pos)                    /*!< 0x00000008 */
#define ETH_MTLTXQ0ESR_ABS_4                (0x10UL << ETH_MTLTXQ0ESR_ABS_Pos)                   /*!< 0x00000010 */
#define ETH_MTLTXQ0ESR_ABS_5                (0x20UL << ETH_MTLTXQ0ESR_ABS_Pos)                   /*!< 0x00000020 */
#define ETH_MTLTXQ0ESR_ABS_6                (0x40UL << ETH_MTLTXQ0ESR_ABS_Pos)                   /*!< 0x00000040 */
#define ETH_MTLTXQ0ESR_ABS_7                (0x80UL << ETH_MTLTXQ0ESR_ABS_Pos)                   /*!< 0x00000080 */
#define ETH_MTLTXQ0ESR_ABS_8                (0x100UL << ETH_MTLTXQ0ESR_ABS_Pos)                  /*!< 0x00000100 */
#define ETH_MTLTXQ0ESR_ABS_9                (0x200UL << ETH_MTLTXQ0ESR_ABS_Pos)                  /*!< 0x00000200 */
#define ETH_MTLTXQ0ESR_ABS_10               (0x400UL << ETH_MTLTXQ0ESR_ABS_Pos)                  /*!< 0x00000400 */
#define ETH_MTLTXQ0ESR_ABS_11               (0x800UL << ETH_MTLTXQ0ESR_ABS_Pos)                  /*!< 0x00000800 */
#define ETH_MTLTXQ0ESR_ABS_12               (0x1000UL << ETH_MTLTXQ0ESR_ABS_Pos)                 /*!< 0x00001000 */
#define ETH_MTLTXQ0ESR_ABS_13               (0x2000UL << ETH_MTLTXQ0ESR_ABS_Pos)                 /*!< 0x00002000 */
#define ETH_MTLTXQ0ESR_ABS_14               (0x4000UL << ETH_MTLTXQ0ESR_ABS_Pos)                 /*!< 0x00004000 */
#define ETH_MTLTXQ0ESR_ABS_15               (0x8000UL << ETH_MTLTXQ0ESR_ABS_Pos)                 /*!< 0x00008000 */
#define ETH_MTLTXQ0ESR_ABS_16               (0x10000UL << ETH_MTLTXQ0ESR_ABS_Pos)                /*!< 0x00010000 */
#define ETH_MTLTXQ0ESR_ABS_17               (0x20000UL << ETH_MTLTXQ0ESR_ABS_Pos)                /*!< 0x00020000 */
#define ETH_MTLTXQ0ESR_ABS_18               (0x40000UL << ETH_MTLTXQ0ESR_ABS_Pos)                /*!< 0x00040000 */
#define ETH_MTLTXQ0ESR_ABS_19               (0x80000UL << ETH_MTLTXQ0ESR_ABS_Pos)                /*!< 0x00080000 */
#define ETH_MTLTXQ0ESR_ABS_20               (0x100000UL << ETH_MTLTXQ0ESR_ABS_Pos)               /*!< 0x00100000 */
#define ETH_MTLTXQ0ESR_ABS_21               (0x200000UL << ETH_MTLTXQ0ESR_ABS_Pos)               /*!< 0x00200000 */
#define ETH_MTLTXQ0ESR_ABS_22               (0x400000UL << ETH_MTLTXQ0ESR_ABS_Pos)               /*!< 0x00400000 */
#define ETH_MTLTXQ0ESR_ABS_23               (0x800000UL << ETH_MTLTXQ0ESR_ABS_Pos)               /*!< 0x00800000 */

/*************  Bit definition for ETH_MTLTXQ0QWR register  *************/
#define ETH_MTLTXQ0QWR_ISCQW_Pos            (0U)
#define ETH_MTLTXQ0QWR_ISCQW_Msk            (0x3FFFUL << ETH_MTLTXQ0QWR_ISCQW_Pos)               /*!< 0x00003FFF */
#define ETH_MTLTXQ0QWR_ISCQW                ETH_MTLTXQ0QWR_ISCQW_Msk                            /*!< IdleSlopeCredit or Weights */

/*************  Bit definition for ETH_MTLQ0ICSR register  *************/
#define ETH_MTLQ0ICSR_TXUNFIS_Pos           (0U)
#define ETH_MTLQ0ICSR_TXUNFIS_Msk           (0x1UL << ETH_MTLQ0ICSR_TXUNFIS_Pos)                 /*!< 0x00000001 */
#define ETH_MTLQ0ICSR_TXUNFIS               ETH_MTLQ0ICSR_TXUNFIS_Msk                           /*!< Transmit Queue Underflow Interrupt Status */
#define ETH_MTLQ0ICSR_ABPSIS_Pos            (1U)
#define ETH_MTLQ0ICSR_ABPSIS_Msk            (0x1UL << ETH_MTLQ0ICSR_ABPSIS_Pos)                  /*!< 0x00000002 */
#define ETH_MTLQ0ICSR_ABPSIS                ETH_MTLQ0ICSR_ABPSIS_Msk                            /*!< Average Bits Per Slot Interrupt Status */
#define ETH_MTLQ0ICSR_TXUIE_Pos             (8U)
#define ETH_MTLQ0ICSR_TXUIE_Msk             (0x1UL << ETH_MTLQ0ICSR_TXUIE_Pos)                   /*!< 0x00000100 */
#define ETH_MTLQ0ICSR_TXUIE                 ETH_MTLQ0ICSR_TXUIE_Msk                             /*!< Transmit Queue Underflow Interrupt Enable */
#define ETH_MTLQ0ICSR_ABPSIE_Pos            (9U)
#define ETH_MTLQ0ICSR_ABPSIE_Msk            (0x1UL << ETH_MTLQ0ICSR_ABPSIE_Pos)                  /*!< 0x00000200 */
#define ETH_MTLQ0ICSR_ABPSIE                ETH_MTLQ0ICSR_ABPSIE_Msk                            /*!< Average Bits Per Slot Interrupt Enable */
#define ETH_MTLQ0ICSR_RXOVFIS_Pos           (16U)
#define ETH_MTLQ0ICSR_RXOVFIS_Msk           (0x1UL << ETH_MTLQ0ICSR_RXOVFIS_Pos)                 /*!< 0x00010000 */
#define ETH_MTLQ0ICSR_RXOVFIS               ETH_MTLQ0ICSR_RXOVFIS_Msk                           /*!< Receive Queue Overflow Interrupt Status */
#define ETH_MTLQ0ICSR_RXOIE_Pos             (24U)
#define ETH_MTLQ0ICSR_RXOIE_Msk             (0x1UL << ETH_MTLQ0ICSR_RXOIE_Pos)                   /*!< 0x01000000 */
#define ETH_MTLQ0ICSR_RXOIE                 ETH_MTLQ0ICSR_RXOIE_Msk                             /*!< Receive Queue Overflow Interrupt Enable */

