STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251cxx_ca35.h
#define OTFDEC_ICR_KEIF_Pos                    (2U)
#define OTFDEC_ICR_KEIF_Msk                    (0x1UL << OTFDEC_ICR_KEIF_Pos)                /*!< 0x00000004 */
#define OTFDEC_ICR_KEIF                        OTFDEC_ICR_KEIF_Msk                           /*!< Key Error Interrupt Flag clear bit */

/******************  Bit definition for OTFDEC_IER register  *****************/
#define OTFDEC_IER_SEIE_Pos                    (0U)
#define OTFDEC_IER_SEIE_Msk                    (0x1UL << OTFDEC_IER_SEIE_Pos)                /*!< 0x00000001 */
#define OTFDEC_IER_SEIE                        OTFDEC_IER_SEIE_Msk                           /*!< Security Error Interrupt Enable bit */

#define OTFDEC_IER_XONEIE_Pos                  (1U)
#define OTFDEC_IER_XONEIE_Msk                  (0x1UL << OTFDEC_IER_XONEIE_Pos)              /*!< 0x00000002 */
#define OTFDEC_IER_XONEIE                      OTFDEC_IER_XONEIE_Msk                         /*!< Execute-only Error Interrupt Enable bit */

#define OTFDEC_IER_KEIE_Pos                    (2U)
#define OTFDEC_IER_KEIE_Msk                    (0x1UL << OTFDEC_IER_KEIE_Pos)                /*!< 0x00000004 */
#define OTFDEC_IER_KEIE                        OTFDEC_IER_KEIE_Msk

/****************  Bit definition for OTFDEC_HWCFGR register  *****************/
#define OTFDEC_HWCFGR_CFG1_Pos                  (0U)
#define OTFDEC_HWCFGR_CFG1_Msk                  (0xFFUL << OTFDEC_HWCFGR_CFG1_Pos)                   /*!< 0x000000FF */
#define OTFDEC_HWCFGR_CFG1                      OTFDEC_HWCFGR_CFG1_Msk                              /*!< HW Generic 1 */
#define OTFDEC_HWCFGR_CFG2_Pos                  (8U)
#define OTFDEC_HWCFGR_CFG2_Msk                  (0xFFUL << OTFDEC_HWCFGR_CFG2_Pos)                   /*!< 0x0000FF00 */
#define OTFDEC_HWCFGR_CFG2                      OTFDEC_HWCFGR_CFG2_Msk                              /*!< HW Generic 2 */
#define OTFDEC_HWCFGR_CFG3_Pos                  (16U)
#define OTFDEC_HWCFGR_CFG3_Msk                  (0xFFUL << OTFDEC_HWCFGR_CFG3_Pos)                   /*!< 0x00FF0000 */
#define OTFDEC_HWCFGR_CFG3                      OTFDEC_HWCFGR_CFG3_Msk                              /*!< HW Generic 3 */
#define OTFDEC_HWCFGR_CFG4_Pos                  (24U)
#define OTFDEC_HWCFGR_CFG4_Msk                  (0xFUL << OTFDEC_HWCFGR_CFG4_Pos)                    /*!< 0x0F000000 */
#define OTFDEC_HWCFGR_CFG4                      OTFDEC_HWCFGR_CFG4_Msk                              /*!< HW Generic 4 */

/*****************  Bit definition for OTFDEC_VERR register  ******************/
#define OTFDEC_VERR_MINREV_Pos                  (0U)
#define OTFDEC_VERR_MINREV_Msk                  (0xFUL << OTFDEC_VERR_MINREV_Pos)                    /*!< 0x0000000F */
#define OTFDEC_VERR_MINREV                      OTFDEC_VERR_MINREV_Msk                              /*!< Minor revision */
#define OTFDEC_VERR_MAJREV_Pos                  (4U)
#define OTFDEC_VERR_MAJREV_Msk                  (0xFUL << OTFDEC_VERR_MAJREV_Pos)                    /*!< 0x000000F0 */
#define OTFDEC_VERR_MAJREV                      OTFDEC_VERR_MAJREV_Msk                              /*!< Major revision */

/*****************  Bit definition for OTFDEC_IPIDR register  *****************/
#define OTFDEC_IPIDR_ID_Pos                     (0U)
#define OTFDEC_IPIDR_ID_Msk                     (0xFFFFFFFFUL << OTFDEC_IPIDR_ID_Pos)                /*!< 0xFFFFFFFF */
#define OTFDEC_IPIDR_ID                         OTFDEC_IPIDR_ID_Msk                                 /*!< Identification Code */

/*****************  Bit definition for OTFDEC_SIDR register  ******************/
#define OTFDEC_SIDR_SID_Pos                     (0U)
#define OTFDEC_SIDR_SID_Msk                     (0xFFFFFFFFUL << OTFDEC_SIDR_SID_Pos)                /*!< 0xFFFFFFFF */
#define OTFDEC_SIDR_SID                         OTFDEC_SIDR_SID_Msk                                 /*!< Size Identification Code */

/******************************************************************************/
/*                                                                            */
/*                       Public Key Accelerator (PKA)                         */
/*                       refere to PKA2 v1.0 data-sheet                       */
/*                                                                            */
/******************************************************************************/
#define PKA_VERSION_V2_0              (1U)                                 /*!< i.e. MP2 uses PKA version v2.0 */

/*******************  Bits definition for PKA_CR register  **************/
#define PKA_CR_EN_Pos              (0U)
#define PKA_CR_EN_Msk              (0x1UL << PKA_CR_EN_Pos)                /*!< 0x00000001 */
#define PKA_CR_EN                  PKA_CR_EN_Msk                           /*!< PKA enable */
#define PKA_CR_START_Pos           (1U)
#define PKA_CR_START_Msk           (0x1UL << PKA_CR_START_Pos)             /*!< 0x00000002 */
#define PKA_CR_START               PKA_CR_START_Msk                        /*!< Start operation */
#define PKA_CR_MODE_Pos            (8U)
#define PKA_CR_MODE_Msk            (0x3FUL << PKA_CR_MODE_Pos)             /*!< 0x00003F00 */
#define PKA_CR_MODE                PKA_CR_MODE_Msk                         /*!< MODE[5:0] PKA operation code */
#define PKA_CR_MODE_0              (0x01UL << PKA_CR_MODE_Pos)              /*!< 0x00000100 */
#define PKA_CR_MODE_1              (0x02UL << PKA_CR_MODE_Pos)              /*!< 0x00000200 */
#define PKA_CR_MODE_2              (0x04UL << PKA_CR_MODE_Pos)              /*!< 0x00000400 */
#define PKA_CR_MODE_3              (0x08UL << PKA_CR_MODE_Pos)              /*!< 0x00000800 */
#define PKA_CR_MODE_4              (0x10UL << PKA_CR_MODE_Pos)              /*!< 0x00001000 */
#define PKA_CR_MODE_5              (0x20UL << PKA_CR_MODE_Pos)              /*!< 0x00002000 */
#define PKA_CR_PROCENDIE_Pos       (17U)
#define PKA_CR_PROCENDIE_Msk       (0x1UL << PKA_CR_PROCENDIE_Pos)         /*!< 0x00020000 */
#define PKA_CR_PROCENDIE           PKA_CR_PROCENDIE_Msk                    /*!< End of operation interrupt enable */
#define PKA_CR_RAMERRIE_Pos        (19U)
#define PKA_CR_RAMERRIE_Msk        (0x1UL << PKA_CR_RAMERRIE_Pos)          /*!< 0x00080000 */
#define PKA_CR_RAMERRIE            PKA_CR_RAMERRIE_Msk                     /*!< RAM error interrupt enable */
#define PKA_CR_ADDRERRIE_Pos       (20U)
#define PKA_CR_ADDRERRIE_Msk       (0x1UL << PKA_CR_ADDRERRIE_Pos)         /*!< 0x00100000 */
#define PKA_CR_ADDRERRIE           PKA_CR_ADDRERRIE_Msk                    /*!< addr error interrupt enable */
#define PKA_CR_OPERRIE_Pos         (21U)
#define PKA_CR_OPERRIE_Msk         (0x1UL << PKA_CR_OPERRIE_Pos)           /*!< 0x01000000 */
#define PKA_CR_OPERRIE             PKA_CR_OPERRIE_Msk                      /*!< oper error interrupt enable */

