STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251cxx_ca35.h
/****************  Bit definition for RAMCFG_*RAM_ISR registers  **************/
#define RAMCFG_ISR_SEC_Pos                  (0U)
#define RAMCFG_ISR_SEC_Msk                  (0x1UL << RAMCFG_ISR_SEC_Pos)           /*!< 0x00000001 */
#define RAMCFG_ISR_SEC                      RAMCFG_ISR_SEC_Msk                      /*!< ECC Single Error Corrected */
#define RAMCFG_ISR_DED_Pos                  (1U)
#define RAMCFG_ISR_DED_Msk                  (0x1UL << RAMCFG_ISR_DED_Pos)           /*!< 0x00000002 */
#define RAMCFG_ISR_DED                      RAMCFG_ISR_DED_Msk                      /*!< ECC Double Error Detected */
#define RAMCFG_ISR_SRAMBUSY_Pos             (8U)
#define RAMCFG_ISR_SRAMBUSY_Msk             (0x1UL << RAMCFG_ISR_SRAMBUSY_Pos)      /*!< 0x00000100 */
#define RAMCFG_ISR_SRAMBUSY                 RAMCFG_ISR_SRAMBUSY_Msk                 /*!< SRAM busy with erase operation */

/***************  Bit definition for RAMCFG_RETRAM.SEAR register  *************/
#define RAMCFG_SEAR_ESEA_Pos                (0U)
#define RAMCFG_RETRAM_SEAR_ESEA_Msk         (0x7FFFUL << RAMCFG_SEAR_ESEA_Pos)      /*!< 0x00007FFF */
#define RAMCFG_RETRAM_SEAR_ESEA             RAMCFG_RETRAM_SEAR_ESEA_Msk             /*!< ECC Single Error Address */
/**************  Bit definition for RAMCFG_BKPSRAM.SEAR register  *************/
#define RAMCFG_BKPSRAM_SEAR_ESEA_Msk        (0x7FFUL << RAMCFG_SEAR_ESEA_Pos)       /*!< 0x000007FF */
#define RAMCFG_BKPSRAM_SEAR_ESEA            RAMCFG_BKPSRAM_SEAR_ESEA_Msk            /*!< ECC Single Error Address */

/***************  Bit definition for RAMCFG_RETRAM.DEAR register  *************/
#define RAMCFG_DEAR_EDEA_Pos                (0U)
#define RAMCFG_RETRAM_DEAR_EDEA_Msk         (0x7FFFUL << RAMCFG_DEAR_EDEA_Pos)      /*!< 0x00007FFF */
#define RAMCFG_RETRAM_DEAR_EDEA             RAMCFG_RETRAM_DEAR_EDEA_Msk             /*!< ECC Double Error Address */
/**************  Bit definition for RAMCFG_BKPSRAM.SEAR register  *************/
#define RAMCFG_BKPSRAM_DEAR_EDEA_Msk        (0x7FFUL << RAMCFG_DEAR_EDEA_Pos)       /*!< 0x000007FF */
#define RAMCFG_BKPSRAM_DEAR_EDEA            RAMCFG_BKPSRAM_DEAR_EDEA_Msk            /*!< ECC Double Error Address */

/****************  Bit definition for RAMCFG_*RAM_ICR registers  **************/
#define RAMCFG_ICR_CSEC_Pos                 (0U)
#define RAMCFG_ICR_CSEC_Msk                 (0x1UL << RAMCFG_ICR_CSEC_Pos)          /*!< 0x00000001 */
#define RAMCFG_ICR_CSEC                     RAMCFG_ICR_CSEC_Msk                     /*!< Clear ECC Single Error Corrected */
#define RAMCFG_ICR_CDED_Pos                 (1U)
#define RAMCFG_ICR_CDED_Msk                 (0x1UL << RAMCFG_ICR_CDED_Pos)          /*!< 0x00000002 */
#define RAMCFG_ICR_CDED                     RAMCFG_ICR_CDED_Msk                     /*!< Clear ECC Double Error Detected */

/**************  Bit definition for RAMCFG_*RAM_ECCKEYR registers  ************/
#define RAMCFG_ECCKEYR_ECCKEY_Pos           (0U)
#define RAMCFG_ECCKEYR_ECCKEY_Msk           (0xFFUL << RAMCFG_ECCKEYR_ECCKEY_Pos)   /*!< 0x000000FF */
#define RAMCFG_ECCKEYR_ECCKEY               RAMCFG_ECCKEYR_ECCKEY_Msk               /*!< ECC Write Protection Key */

/**************  Bit definition for RAMCFG_*RAM_ERKEYR registers  *************/
#define RAMCFG_ERKEYR_ERASEKEY_Pos          (0U)
#define RAMCFG_ERKEYR_ERASEKEY_Msk          (0xFFUL << RAMCFG_ERKEYR_ERASEKEY_Pos)  /*!< 0x000000FF */
#define RAMCFG_ERKEYR_ERASEKEY              RAMCFG_ERKEYR_ERASEKEY_Msk              /*!< Erase Write Protection Key */

/***************  Bit definition for RAMCFG_*RAM_CCR1 registers  **************/
#define RAMCFG_CCR1_CRCC_Pos                (0U)
#define RAMCFG_CCR1_CRCC_Msk                (0x3UL << RAMCFG_CCR1_CRCC_Pos)         /*!< 0x00000003 */
#define RAMCFG_CCR1_CRCC                    RAMCFG_CCR1_CRCC_Msk                    /*!< CRC configuration */
#define RAMCFG_CCR1_CRCBS_Pos               (4U)
#define RAMCFG_CCR1_CRCBS_Msk               (0x7UL << RAMCFG_CCR1_CRCBS_Pos)        /*!< 0x00000070 */
#define RAMCFG_CCR1_CRCBS                   RAMCFG_CCR1_CRCBS_Msk                   /*!< CRC Buffer Size */

/***************  Bit definition for RAMCFG_*RAM_CCR2 registers  **************/
#define RAMCFG_CCR2_CRCCS_Pos               (0U)
#define RAMCFG_CCR2_CRCCS_Msk               (0x1UL << RAMCFG_CCR2_CRCCS_Pos)        /*!< 0x00000001 */
#define RAMCFG_CCR2_CRCCS                   RAMCFG_CCR2_CRCCS_Msk                   /*!< CRC computation start */
#define RAMCFG_CCR2_CRCFC_Pos               (31U)
#define RAMCFG_CCR2_CRCFC_Msk               (0x1UL << RAMCFG_CCR2_CRCFC_Pos)        /*!< 0x80000000 */
#define RAMCFG_CCR2_CRCFC                   RAMCFG_CCR2_CRCFC_Msk                   /*!< CRC flags clear */

/****************  Bit definition for RAMCFG_*_CRSR registers  ****************/
#define RAMCFG_CRSR_CRCRS_Pos               (0U)
#define RAMCFG_CRSR_CRCRS_Msk               (0xFFFFFFFFUL << RAMCFG_CRSR_CRCRS_Pos) /*!< 0xFFFFFFFF */
#define RAMCFG_CRSR_CRCRS                   RAMCFG_CRSR_CRCRS_Msk                   /*!< CRC reference signature */

/*****************  Bit definition for RAMCFG_*_CSR registers  ****************/
#define RAMCFG_CSR_CRCEOC_Pos               (0U)
#define RAMCFG_CSR_CRCEOC_Msk               (0x1UL << RAMCFG_CSR_CRCEOC_Pos)        /*!< 0x00000001 */
#define RAMCFG_CSR_CRCEOC                   RAMCFG_CSR_CRCEOC_Msk                   /*!< CRC End Of Computation flag */
#define RAMCFG_CSR_CRCSCS_Pos               (1U)
#define RAMCFG_CSR_CRCSCS_Msk               (0x1UL << RAMCFG_CSR_CRCSCS_Pos)        /*!< 0x00000002 */
#define RAMCFG_CSR_CRCSCS                   RAMCFG_CSR_CRCSCS_Msk                   /*!< CRC Signature Check Status flag */

/****************  Bit definition for RAMCFG_*_CCSR registers  ****************/
#define RAMCFG_CCSR_CRCCS_Pos               (0U)
#define RAMCFG_CCSR_CRCCS_Msk               (0xFFFFFFFFUL << RAMCFG_CCSR_CRCCS_Pos) /*!< 0xFFFFFFFF */
#define RAMCFG_CCSR_CRCCS                   RAMCFG_CCSR_CRCCS_Msk                   /*!< CRC calculated signature */

/*******************************************************/
/*           Reset and Clock Control (RCC)             */
/* Reference document :                                */
/*     Chapter #22 "Reset and clock control (RCC)"     */
/*     RM0457 - Reference Manual - STM32MP25xx         */
/*     advanced ARM-based 32/64-bit MPUs               */
/*     file "DM00485804 (RM0457) Rev0.1.pdf"           */
/*     (Revision 0.1 / 09-Mar-2021)                    */
/*******************************************************/
/* Bit fields for RCC_SECCFGR0 register */
#define RCC_SECCFGR0_SEC_Pos                         (0U)
#define RCC_SECCFGR0_SEC_Msk                         (0xFFFFFFFFUL << RCC_SECCFGR0_SEC_Pos)                 /*!< 0xFFFFFFFF */
#define RCC_SECCFGR0_SEC                             RCC_SECCFGR0_SEC_Msk                                  /*!< Secure attribute reference for local resource number x */

/* Bit fields for RCC_SECCFGR1 register */
#define RCC_SECCFGR1_SEC_Pos                         (0U)
#define RCC_SECCFGR1_SEC_Msk                         (0xFFFFFFFFUL << RCC_SECCFGR1_SEC_Pos)                 /*!< 0xFFFFFFFF */
#define RCC_SECCFGR1_SEC                             RCC_SECCFGR1_SEC_Msk                                  /*!< Secure attribute reference for the local resource number x */

/* Bit fields for RCC_SECCFGR2 register */
#define RCC_SECCFGR2_SEC_Pos                         (0U)
#define RCC_SECCFGR2_SEC_Msk                         (0xFFFFFFFFUL << RCC_SECCFGR2_SEC_Pos)                 /*!< 0xFFFFFFFF */
#define RCC_SECCFGR2_SEC                             RCC_SECCFGR2_SEC_Msk                                  /*!< Secure attribute reference for the local resource number x */

